app/views/posts/show.html.erb

<div class="container px-6 px-lg-5">
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]