app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1000]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("content", "post_id", "author_id", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hi"], ["post_id", 2], ["author_id", "1000"], ["author", "Haoran Zhu"], ["created_at", "2021-12-06 01:09:07.721024"], ["updated_at", "2021-12-06 01:09:07.721024"]]
---
    def create
        user = User.find(session[:user_id])
        post = Post.find(params[:id])
        comment = post.comments.build(comment_params)
        comment.author_id = session[:user_id]
        comment.author = user.username
        comment.save