app/controllers/deals_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "deals" ("title", "status", "buyer_id", "buyer_name", "seller_id", "seller_name", "created_at", "updated_at", "rating", "post_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # deals can only be created by buyer
        puts session
        buyer = User.find(session[:user_id])
        post = Post.find(params[:id])
        deal = post.deals.build()
        deal.title = post.title
        deal.buyer_id = session[:user_id]
        deal.buyer_name = buyer.username

        deal.seller_id = post.author_id
        deal.seller_name = post.author
        deal.status = "unsettled"
        deal.rating = -1
        deal.save

SELECT  "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "deals" WHERE "deals"."id" = ?  [["id", 1]]
---
    def destroy
        deal = Deal.find(params[:id])
        deal.destroy

SELECT "deals".* FROM "deals" WHERE (post_id = 6 and status = 'unsettled')
UPDATE "deals" SET "status" = ?, "updated_at" = ? WHERE "deals"."id" = ?  [["status", "accepted"], ["updated_at", "2021-12-17 20:56:36.883826"], ["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "posts" SET "onshelf" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["onshelf", 0], ["updated_at", "2021-12-17 20:56:36.892872"], ["id", 6]]
---
    def update
        # accept a deal
        deal = Deal.find(params[:id])
        deal.status = 'accepted'
        deal.save

        # all other deals with the same post id should be rejected
        all_requests = Deal.get_all_unsettled_requests_from_post_id(deal.post_id)
        all_requests.each do |request|
            if request.id != deal.id
                puts request.title
                puts request.id
                request.status = 'declined'
                request.save
            end
        end

        # make post offshelf
        post = Post.find(deal.post_id)
        post.onshelf = 0
        post.save

SELECT  "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "deals" SET "rating" = ?, "updated_at" = ? WHERE "deals"."id" = ?  [["rating", 2], ["updated_at", "2021-12-17 21:16:23.592198"], ["id", 1]]
---
    def rate
        # Make a rating
        deal = Deal.find(params[:id])
        rating = params[:deal][:rating]
        deal.rating = rating.to_i
        deal.save