app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    @user = User.find(session[:user_id])

UPDATE "posts" SET "onshelf" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["onshelf", 0], ["updated_at", "2021-12-06 19:33:25.664320"], ["id", 4]]
SELECT "deals".* FROM "deals" WHERE (post_id = 4 and status = 'unsettled')
---
  def destroy
    @post = Post.find(params[:id])
    # @post.destroy
    @post.onshelf = 0
    @post.save
    all_requests = Deal.get_all_unsettled_requests_from_post_id(@post.id)
    all_requests.each do |request|