app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @post = Post.find(id) # look up movie by unique ID

SELECT "posts".* FROM "posts" WHERE (onshelf = 1)  ORDER BY created_at DESC
---
  def index
    puts "index!"
    @posts = Post.all

INSERT INTO "posts" ("title", "content", "author", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test4"], ["content", "CCCDDD"], ["author", "test4author"], ["category", "sublease"], ["created_at", "2021-11-02 10:03:36.047717"], ["updated_at", "2021-11-02 10:03:36.047717"]]
UPDATE "posts" SET "author_id" = ?, "author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author_id", "1"], ["author", "Wujie Duan"], ["updated_at", "2021-11-17 03:48:52.198233"], ["id", 5]]
---
  def create
    @post = Post.create!(post_params)
    @post.author_id = session[:user_id]
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "author" = ?, "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author", "testauthor111"], ["category", "sublease"], ["updated_at", "2021-11-02 09:54:41.801417"], ["id", 1]]
---
  def update
    @post = Post.find params[:id]
    @post.update_attributes!(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy