app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "provider", "username", "email", "password") VALUES (?, ?, ?, ?, ?)  [["uid", "102457936701847489756"], ["provider", "google_oauth2"], ["username", "Haoran Zhu"], ["email", "hz2712@columbia.edu"], ["password", "19b1ab90b91e62beccb28b018c486a2b"]]
---
    def omniauth
      # facebook and google create action
      @user = User.from_omniauth(auth)
      @user.save