app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
    def show_other
        other_id = params[:id]
        @user = User.find(other_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def edit
        @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "phone" = ?, "address" = ?, "description" = ? WHERE "users"."id" = ?  [["phone", "123"], ["address", "1234"], ["description", "12345"], ["id", 1]]
---
    def update
        @user = User.find(session[:user_id])
        @user.update_attributes!(user_params)